# Задача 5
# Зарплата сотрудника составляет salary руб., 
# Расходы на проживание превышают зараплату и составляют expenses руб. в месяц. 
# Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Напишите скрипт расчета суммы денег, которую необходимо взять в долг, 
# чтобы можно было прожить ближайший год (12 месяцев).
# Формат вывода:
# Необходимо взять в долг ХХХ.ХХ рублей

salary, expenses = 10000, 12000
summ = expenses

for i in range(12):
    if i != 1:
        expenses = expenses * 1.03
        summ = summ + expenses
print(summ)    

dolg = (expenses + summ) - (salary * 12)

print("Необходимо взять в долг", dolg )


 